---
kind: property
id: P:Autodesk.Revit.DB.Visual.Stone.StonePatternAmount
source: html/2b4f15ed-190c-3f0c-4a20-9e55411d95ba.htm
---
# Autodesk.Revit.DB.Visual.Stone.StonePatternAmount Property

The property labeled "Amount" from the "Stone" schema.

## Syntax (C#)
```csharp
public static string StonePatternAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".